; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 273487 1 2 3 5 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image2 - mode
	thermograph1 - mode
	infrared0 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation1 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared0)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
)
(:goal (and
	(have_image Planet5 image2)
	(have_image Phenomenon6 infrared0)
	(have_image Star7 image2)
	(have_image Star8 image2)
	(have_image Star9 thermograph1)
	(have_image Planet10 thermograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 groundstation1 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 star9 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star9)
   goals met: 0 of 6
5. (take_image satellite0 star9 instrument0 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 1 of 6
6. (turn_to satellite0 star8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star8)
   goals met: 1 of 6
7. (take_image satellite0 star8 instrument0 image2)
   added: (have_image star8 image2)
   goals met: 2 of 6
8. (turn_to satellite0 planet5 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet5)
   goals met: 2 of 6
9. (take_image satellite0 planet5 instrument0 image2)
   added: (have_image planet5 image2)
   goals met: 3 of 6
10. (turn_to satellite0 planet10 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet10)
   goals met: 3 of 6
11. (take_image satellite0 planet10 instrument0 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 4 of 6
12. (turn_to satellite0 phenomenon6 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 6
13. (take_image satellite0 phenomenon6 instrument0 infrared0)
   added: (have_image phenomenon6 infrared0)
   goals met: 5 of 6
14. (turn_to satellite0 star7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star7)
   goals met: 5 of 6
15. (take_image satellite0 star7 instrument0 image2)
   added: (have_image star7 image2)
   goals met: 6 of 6
